import React from "react";
import {
  Box,
  Text
} from "@chakra-ui/react"

const UserAgreement = () => {
  return (
    <Box padding='40px'>
      <Text as='b' fontSize='4xl'>Пользовательское соглашение сервиса по заказу и доставке Продукции</Text>
      <br />
      <br />
      <Text as='b' fontSize='xl'>1. В настоящем Пользовательском соглашении используются термины и определения, имеющие следующие значения:</Text>
      <br />
      <br />
      <Text align='justify' fontSize='xl'>«Оператор» — Общество с ограниченной ответственностью «Фуд ин Флайт» (место нахождения: 190005, Санкт-Петербург, 1-я Красноармейская ул., 1).</Text>
      <br />
      <Text align='justify' fontSize='xl'>«Средство оформления заказа» — принадлежащие Оператору и обладающие функциями оформления Заказа сервисы: сайт в сети Интернет: foodflight.ru (далее – Сайт); приложение для мобильных устройств -программа ЭВМ (далее – Мобильное приложение).</Text>
      <br />
      <Text align='justify' fontSize='xl'>«Производитель» — юридическое лицо, осуществляющие приготовление и реализацию Продукции с доставкой Клиенту с помощью Средства оформления заказа.</Text>
      <br />
      <Text align='justify' fontSize='xl'>«Клиент» — любое дееспособное и совершеннолетнее физическое лицо, использующее Средство оформления заказа с целью ознакомления с Продукцией, реализуемой Производителем, и оформления Заказа на Продукцию с доставкой.</Text>
      <br />
      <Text align='justify' fontSize='xl'>«Заказ» — согласованная с помощью Средства оформления заказа в установленном настоящим Пользовательском соглашении порядке и на условиях, определенных Производителем, между Клиентом и Производителем заявка на приготовление и доставку Продукции, в результате которой заключается соглашение между Клиентом и Производителем на приготовление и доставку Продукции.</Text>
      <br />
      <Text align='justify' fontSize='xl'>«Продукция» — кулинарные блюда и напитки, изготавливаемые и реализуемые Производителем Клиентам с помощью Средства оформления заказа.</Text>
      <br />
      <br />
      <Text as='b' fontSize='xl'>2. Общие положения и правила пользования.</Text>
      <br />
      <br />
      <Text align='justify' fontSize='xl'>2.1. До начала использования Средства оформления заказа Клиент обязан ознакомиться с настоящим Пользовательским соглашением и всеми условиями о Продукции и доставке, размещенными с помощью Средства оформления заказа. Использование Клиентом Средства оформления заказа любым способом и любой функции означает принятие им условий настоящего Пользовательского соглашения. С момента принятия настоящего Пользовательского соглашения Клиент принимает его полностью без исключений и изменений, без условий и оговорок. Принимая все условия настоящего Соглашения в полном объеме без каких-либо изъятий и ограничений с стороны Клиента, Клиент обязуется их соблюдать или прекратить использование Средства оформления заказа.</Text>
      <br />
      <Text align='justify' fontSize='xl'>2.2. По настоящему Пользовательскому соглашению Оператор предоставляет Клиенту без взимания платы (бесплатно) право использования Средства оформления заказа в целях оформления Заказа. Услуги, оказываемые Производителем по приготовлению и доставке Продукции, являются платными. Условия оформления Заказа размещаются и доводятся до Клиента с помощью Средства оформления заказа. </Text>
      <br />
      <Text align='justify' fontSize='xl'>2.3. Производитель реализует Продукцию и ее доставку по ценам, представленным с помощью Средства оформления заказа. Цена Продукции и стоимость доставки определяются Производителем в одностороннем порядке и могут быть изменены. Производитель вправе устанавливать минимальную сумму Заказа. Сумма минимального Заказа определяется Производителем в одностороннем порядке.</Text>
      <br />
      <Text align='justify' fontSize='xl'>2.4. Производитель вправе в одностороннем порядке вносить изменения в Пользовательское соглашение, а также в реализуемую им Продукцию, а также менять ее стоимость. Информация об изменениях Продукции и ее стоимости доводиться с помощью Средства оформления заказа.</Text>
      <br />
      <br />
      <Text as='b' fontSize='xl'>3. Заключительные положения.</Text>
      <br />
      <br />
      <Text align='justify' fontSize='xl'>3.1. Оператор вправе в одностороннем порядке в любое время без уведомления изменять условия настоящего Пользовательского соглашения путем опубликования таких изменений на сайте в сети Интернет foodflight.ru, при этом изменения вступают в силу и становятся обязательными c момента опубликования таких изменений на сайте. В случае несогласия Клиента с изменениями, он обязан прекратить использование Средства оформления заказа.</Text>
      <br />
      <Text align='justify' fontSize='xl'>3.2. Настоящее Пользовательское соглашение размещается Оператором на сайте в сети Интернет: foodflight.ru.</Text>
      <br />
      <Text align='justify' fontSize='xl'>3.3. Используя Средство оформления заказа, Клиент дает согласие на получение сообщений информационного характера в целях оформления Заказа, а также дает согласие на передачу такой информации Оператором Производителю в целях приготовления и доставки Заказа.</Text>
      <br />
      <br />
      <Text as='b' fontSize='xl'>4. Реквизиты оператора.</Text>
      <br />
      <br />
      <Text align='justify' fontSize='xl'>Фирменное наименование: Общество с ограниченной ответственностью «Фуд ин Флайт»</Text>
      <br />
      <Text align='justify' fontSize='xl'>Место нахождения: 190005, Санкт-Петербург, 1-я Красноармейская ул., 1</Text>
      <br />
      <Text align='justify' fontSize='xl'>Режим работы: 24 часа в сутки, 7 дней в неделю.</Text>
    </Box>
  )
}

export default UserAgreement